Autodesk.Revit.DB.CompoundStructureLayer.LayerCapFlag
Identifies if the layer participates in the cap work.
It is meaningful only for shell layers. The default value is true.

Autodesk.Revit.DB.CompoundStructureLayer.LayerId
The id of the layer - may be different from the index in the array of layers in a CompoundStructure.

Autodesk.Revit.DB.CompoundStructureLayer.DeckEmbeddingType
Embedding type for structural deck - only for a layer whose function is StructuralDeck.
The default is Invalid.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructureLayer.Function
The function of the layer.
The default is None.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: A value passed for an enumeration argument is not a member of that enumeration

Autodesk.Revit.DB.CompoundStructureLayer.#ctor(Autodesk.Revit.DB.CompoundStructureLayer)
Creates a copy of compound structure layer.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL